vtu_2bin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb36b07d">vtu2bin</a></li>
<li><a href="#orgc3cd677">Options</a>
<ul>
<li><a href="#orgcc0d9c6">&#x2013;root Text</a></li>
<li><a href="#orgf4bee42">&#x2013;output TEXT</a></li>
<li><a href="#orgf618c38">&#x2013;file_name TEXT</a></li>
<li><a href="#org2e2e14e">&#x2013;batch</a></li>
<li><a href="#org2a8723c">&#x2013;extension TEXT</a></li>
<li><a href="#orgc22c23a">&#x2013;increment INTEGER</a></li>
<li><a href="#orgdff41df">&#x2013;num_digits INTEGER</a></li>
<li><a href="#org6ebaef2">&#x2013;field_name TEXT</a></li>
<li><a href="#org49c22a7">-h, &#x2013;help</a></li>
</ul>
</li>
<li><a href="#org395878d">Binary File Data Format</a>
<ul>
<li><a href="#orgedbb292">Velocity</a></li>
<li><a href="#org35af79e">Unstructured Mesh</a>
<ul>
<li><a href="#orga106202">Cordinates File</a></li>
<li><a href="#orgd0ad5d8">Connectivity</a></li>
<li><a href="#orgb871fcb">Adjacency</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Home</a></td>
<td class="org-left"><a href="./vtu_2bin.html">vtu2bin</a></td>
<td class="org-left"><a href="./inigenerator.html">inigenerator</a></td>
</tr>
</tbody>
</table>
<div id="outline-container-orgb36b07d" class="outline-2">
<h2 id="orgb36b07d">vtu2bin</h2>
<div class="outline-text-2" id="text-orgb36b07d">
<p>
FlowVC requires the velocity data be converted into binary files prior to exectution. These binary files contain the velocity data as well as the coordinate and connectivity information of your dataset and can be created using the vtu2bin command.
</p>

<p>
If you are using the <a href="./index.html#org76eda93">recomended layout</a> the best way to use this is from the project_root direcory running the following command with the &#x2013;batch flag enabled.
</p>

<div class="org-src-container">
<pre class="src src-shell">python -m flowvcutils vtu2bin START STOP --batch
</pre>
</div>

<p>
Where START and STOP is the starting and stopping timestep for your data set. This will generate the binary files for all of the simulation cases that you have with a single command.
</p>
</div>
</div>

<div id="outline-container-orgc3cd677" class="outline-2">
<h2 id="orgc3cd677">Options</h2>
<div class="outline-text-2" id="text-orgc3cd677">
</div>
<div id="outline-container-orgcc0d9c6" class="outline-3">
<h3 id="orgcc0d9c6">&#x2013;root Text</h3>
<div class="outline-text-3" id="text-orgcc0d9c6">
<p>
In batch mode this is the root to the project directory. Ensure the .vtu files are located in the path root/case_/input_vtu/case_xxxxxx.vtu
</p>

<p>
If batch mode is not used, this is the directory where the .vtu files are located, with the default being the current dirctory.
</p>
</div>
</div>


<div id="outline-container-orgf4bee42" class="outline-3">
<h3 id="orgf4bee42">&#x2013;output TEXT</h3>
<div class="outline-text-3" id="text-orgf4bee42">
<p>
Output directory target to store bin files.
</p>

<p>
Batch Mode: This will be set to root/case_input_bin/
Non Batch Mode: Default = current working directory
</p>
</div>
</div>

<div id="outline-container-orgf618c38" class="outline-3">
<h3 id="orgf618c38">&#x2013;file_name TEXT</h3>
<div class="outline-text-3" id="text-orgf618c38">
<p>
The base file name, used to locate the velocity files. (e.g., case1_ if the ".vtu" files are named case1_00000.vtu).
</p>

<p>
Batch Mode: This will be set to the subdirectory name.
Non Batch Mode: default = current directory name
</p>
</div>
</div>

<div id="outline-container-org2e2e14e" class="outline-3">
<h3 id="org2e2e14e">&#x2013;batch</h3>
<div class="outline-text-3" id="text-org2e2e14e">
<p>
Flag to set the operating mode into Batch Mode to process all subdirectorys in the project. Otherwise it will process a single folder.
</p>
</div>
</div>


<div id="outline-container-org2a8723c" class="outline-3">
<h3 id="org2a8723c">&#x2013;extension TEXT</h3>
<div class="outline-text-3" id="text-org2a8723c">
<p>
File extension of the data files. The default is '.vtu'. File formats ".vtp", ".vtk" and ".pvtu" file formats might work, but they have not been tested.
</p>
</div>
</div>

<div id="outline-container-orgc22c23a" class="outline-3">
<h3 id="orgc22c23a">&#x2013;increment INTEGER</h3>
<div class="outline-text-3" id="text-orgc22c23a">
<p>
The increment between each vtu file (default: 50).
</p>
</div>
</div>

<div id="outline-container-orgdff41df" class="outline-3">
<h3 id="orgdff41df">&#x2013;num_digits INTEGER</h3>
<div class="outline-text-3" id="text-orgdff41df">
<p>
The number of digits in file name, (e.g., 5 for case1_00100.vtu) with the default being 5
</p>
</div>
</div>

<div id="outline-container-org6ebaef2" class="outline-3">
<h3 id="org6ebaef2">&#x2013;field_name TEXT</h3>
<div class="outline-text-3" id="text-org6ebaef2">
<p>
Field name for velocity data within the .vtu files. The default is 'velocity' and this is the only field name that was tested.
</p>
</div>
</div>

<div id="outline-container-org49c22a7" class="outline-3">
<h3 id="org49c22a7">-h, &#x2013;help</h3>
<div class="outline-text-3" id="text-org49c22a7">
<p>
Show the help message with a description of all the options.
</p>
</div>
</div>
</div>


<div id="outline-container-org395878d" class="outline-2">
<h2 id="org395878d">Binary File Data Format</h2>
<div class="outline-text-2" id="text-org395878d">
<p>
FlowVC requires velocity files, and for an unstructured mesh requires a cordinates file, connectivity file, and an adjacency file to define the mesh. These files all share a common prefix, which can be any name you choose and is refered to here as InFilePrefix.
</p>
</div>

<div id="outline-container-orgedbb292" class="outline-3">
<h3 id="orgedbb292">Velocity</h3>
<div class="outline-text-3" id="text-orgedbb292">
<p>
If the velocity is defined discretely in time, each time instant should have its own separate file. The velocity data must be equally spaced in time. File names should follow the format InFilePrefix_vel.#.bin, where # is a unique index for each time instant. The difference between successive file time points must be consistent
</p>

<p>
Each file's content should begin with a time stamp, followed by the velocity vectors at each node.
</p>

\begin{equation}
t_s \; \underbrace{u_0\; v_0\; w_0}_{\text{node 0}} \underbrace{u_1\;  v_1 \; w_1}_{\text{node 1}} ....\; \underbrace{u_{n-1} \; v_{n-1}\; w_{n-1}}_{\text{node n-1}}
\end{equation}

<ul class="org-ul">
<li>Cartesian Data: the order should loop over the x-direction in the innermost loop, followed by y, and then z in the outer loop.</li>
<li>Unstructured Data: The ordering must align with the nodes specified in the InFilePrefix coordinates.#.bin file.</li>
<li>2D Data: you must still specify a third velocity component, \(w_i\), which can be set to 0.0.</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100%">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">t</td>
<td class="org-left">double</td>
</tr>

<tr>
<td class="org-left">u,v,w</td>
<td class="org-left">double</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org35af79e" class="outline-3">
<h3 id="org35af79e">Unstructured Mesh</h3>
<div class="outline-text-3" id="text-org35af79e">
<p>
The unstructured mesh is defined by three files:
</p>
<ul class="org-ul">
<li>Coordinates File : InFilePrefix_coordinates.bin</li>
<li>Connectivity File: InFilePrefix_connectivity.bin</li>
<li>Adjacency File:    InFilePrefix_adjacency.bin</li>
</ul>
</div>

<div id="outline-container-orga106202" class="outline-4">
<h4 id="orga106202">Cordinates File</h4>
<div class="outline-text-4" id="text-orga106202">
\begin{equation}
n \; \underbrace{x_0\; y_0\; z_0}_{\text{node 0}} \underbrace{x_1\;  y_1 \; z_1}_{\text{node 1}} ....\; \underbrace{x_{n-1} \; y_{n-1}\; z_{n-1}}_{\text{node n-1}}
\end{equation}

<ul class="org-ul">
<li>n: The the number of points in the data set</li>
<li>\(x_i \; y_i \; z_i\): The cordinates of each node</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100%">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">\(x_i \; y_i \; z_i\)</td>
<td class="org-left">double</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd0ad5d8" class="outline-4">
<h4 id="orgd0ad5d8">Connectivity</h4>
<div class="outline-text-4" id="text-orgd0ad5d8">
<p>
The connectivity specifies the indices of the 4 nodes that make up each element. The index of each node is based on coordinates file ordering counting from 0.
</p>

\begin{equation}
   e\; \underbrace{i_0^0\; i_0^1\; i_0^2\; i_0^3}_{\text{element 0}} \underbrace{i_1^0\; i_1^1\; i_1^2\; i_1^3}_{\text{element 1}} ... \underbrace{i_{e-1}^0\; i_{e-1}^1\; i_{e-1}^2\; i_{e-1}^3}_{\text{element e-1}}
\end{equation}

<ul class="org-ul">
<li>e: The number of elements in the data set</li>
<li>\(i_i^j\): The index of the j'th node making i'th element in the dataset</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100%">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">e</td>
<td class="org-left">int</td>
</tr>

<tr>
<td class="org-left">\(i_i^j\)</td>
<td class="org-left">int</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb871fcb" class="outline-4">
<h4 id="orgb871fcb">Adjacency</h4>
<div class="outline-text-4" id="text-orgb871fcb">
<p>
The adjacency file contains the indices of the adacent elements that share a face with the current element. The index of each element is based on the order of the connectivity file.
</p>

\begin{equation}
   e\; \underbrace{e_0^0\; e_0^1\; e_0^2\; e_0^3}_{\text{element 0}} \underbrace{e_1^0\; e_1^1\; e_1^2\; e_1^3}_{\text{element 1}} ... \underbrace{e_{e-1}^0\; e_{e-1}^1\; e_{e-1}^2\; e_{e-1}^3}_{\text{element e-1}}
\end{equation}

<ul class="org-ul">
<li>Boundary Elements: For faces not shared with other elements set \(e=-1\)</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org8d4c578"></a>Data Type<br />
<div class="outline-text-5" id="text-org8d4c578">
<p>
e(int): The number of elements in the data set
\(e_i^j\) (int): The index of the element that shares the j'th face for the ith element in the dataset. Note if the element face is not shared with another element (i.e. on the edge this is a -1)
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
